import time
from multiprocessing import Pool
import requests
from bs4 import BeautifulSoup


def search_result(html):
    # print(html)
    soup = BeautifulSoup(html, 'html.parser')
    result_count = soup.select_one('#result-stats')
    print(result_count.get_text())


def search_keyword(keyword):
    base_url = 'https://www.google.co.kr/search'

    #: 검색조건 설정
    values = {
        'sxsrf': 'ALeKk019OlTWuIKsVgBJ8SetotOu9RVY5Q:1609994327560',
        'ei': 'V5D2X-raIYPT-Qah1rOAAg',
        'q': keyword,  # 검색할 내용
        'oq': keyword,
        'gs_lcp': 'CgZwc3ktYWIQAzIFCCEQoAFQAFgAYNLkEGgAcAB4AIABjQGIAY0BkgEDMC4xmAEAqgEHZ3dzLXdpesABAQ',
        'sclient': 'psy-ab',
        'ved': '0ahUKEwiq4u-fgInuAhWDad4KHSHrDCAQ4dUDCA0',
        'uact': '5'
    }

    # Google에서는 Header 설정 필요
    hdr = {'User-Agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 11_1_0) AppleWebKit/537.36 (KHTML, like Gecko) \ Chrome/87.0.4280.88 Safari/537.36',
           'sec-ch-ua': '"Google Chrome";v="87"," Not;A Brand";v="99","Chromium";v="87"',
           'accept-language': 'ko-KR,ko;q=0.9,en-US;q=0.8,en;q=0.7',
           'accept-encoding': 'gzip,deflate,br'
           }

    response = requests.get(base_url, params=values, headers=hdr)

    if response.status_code == 200:
        # print(response.url)
        # print(response.headers)
        # print(response.text)

        # soup = BeautifulSoup(response.text, 'html.parser')
        # result_count = soup.select_one('#result-stats')
        # print(result_count.get_text())

        search_result(response.text)
    else:
        print(response.status_code)


if __name__ == '__main__':
    # keywords = ['칼칼한 김치볶음밥', '"칼칼한 김치볶음밥"', '칼칼한 AND 김치볶음밥']
    keywords = [
        '백반', '산채정식', '쌈밥정식', '한정식', '곤드레나물밥', '굴국밥', '굴밥', '김밥', '김치김밥', '김치볶음밥', '낙지덮밥', '누룽지',
        '대나무통밥', '돌솥비빔밥', '돼지국밥', '따로국밥', '멍게비빔밥', '메밀감자비빔밥', '묵밥', '밥', '보리밥', '불고기덮밥', '비빔밥',
        '산채비빔밥', '삼선비빔밥', '새싹비빔밥', '샐러드김밥', '소고기국밥', '소고기김밥', '소머리국밥', '송어덮밥', '순대국밥', '쌈밥', '알밥',
        '양푼비빔밥', '연잎밥', '열무비빔밥',
        '영양돌솥밥', '오곡밥', '오분작돌솥밥', '오징어덮밥', '우거지사골국밥', '우렁된장비빔밥', '우렁쌈밥', '육회돌솥비빔밥', '육회비빔밥', '잡곡밥',
        '잡채덮밥', '장국밥', '장어덮밥', '전복돌솥밥', '전주비빔밥', '제육덮밥', '제육비빔밥', '제육쌈밥', '주먹밥', '진주비빔밥', '참치김밥', '충무김밥',
        '치즈김밥', '콩나물국밥', '콩나물밥', '헛제삿밥', '황태구이덮밥', '회덮밥', '게게살죽', '녹두죽', '바지락죽', '백합죽', '버섯옥수수죽', '버섯죽',
        '삼계죽', '소고기버섯죽', '어죽', '잣죽', '전복내장죽', '전복죽', '참치죽', '채소죽', '팥죽', '해물죽', '호박죽', '흑임자죽', '감자수제비',
        '감자옹심이', '검정콩국수', '고기국수', '곰국시', '김치말이국수', '냉메밀국수', '느른국', '닭칼국수', '동치미물냉면', '들깨수제비',
        '들깨칼국수', '떡국', '막국수', '매생이굴칼국수', '물냉면', '바지락칼국수', '비빔국수', '비빔냉면', '수제비', '안동국시', '어탕국수', '얼큰수제비',
        '얼큰칼국수', '열무국수', '열무냉면', '열무비빔국수', '온면', '잔치국수', '쟁반국수', '진주냉면', '쫄면', '초계국수', '칡냉면', '칼국수',
        '코다리냉면', '콧등치기국수', '콩국수', '팥칼국수', '평양냉면', '함흥냉면', '항아리수제비', '해물수제비', '해물칼국수', '황태비빔막국수',
        '황태칼국수', '회냉면', '곰칫국', '근댓국', '김치콩나물국', '김칫국', '냉이된장국', '달걀국', '닭개장', '도다리쑥국', '도토리묵사발', '된장국',
        '두부새우젓국', '매생잇국', '매생이굴국', '무된장국', '미역국', '미역냉국', '바지락조갯국', '배추된장국', '버섯육개장', '복국', '북엇국',
        '사골우거지해장국', '선짓국', '섭국', '소고기뭇국', '소고기미역국', '소고기육개장', '순댓국', '시금치된장국', '시래기된장국', '쑥된장국', '아욱국',
        '어묵국', '오이냉국', '오징엇국', '올갱잇국', '우거지된장국', '우거지해장국', '우렁된장국', '육개장', '재첩국', '초당순두부', '콩나물국',
        '콩나물해장국', '토란국', '해장국', '홍합미역국', '황태해장국', '갈낙탕', '갈비탕', '감자탕', '곰탕', '광어매운탕', '굴탕', '꼬리곰탕',
        '꽃게탕', '내장탕', '닭곰탕', '대구맑은탕', '대구매운탕', '대합탕', '도가니탕', '도미맑은탕', '도미매운탕', '동태탕', '뚜거리탕', '뚝배기불고기',
        '롤삼계탕', '매운탕', '메기매운탕', '민어탕', '버섯들깨탕', '복맑은탕', '복매운탕', '사골우거지갈비탕', '삼계탕', '생태탕', '설렁탕',
        '쏘가리매운탕', '아귀탕', '알탕', '양곰탕', '연포탕', '영양한우갈비탕', '왕갈비탕', '우거지갈비탕', '우럭매운탕', '우족탕', '장어탕', '전복삼계탕',
        '조개탕', '조기매운탕', '참게매운탕', '초계탕', '추어탕', '콩비지탕', '콩탕', '해물탕', '홍어탕', '홍합탕', '갈치찌개', '강된장', '고추장찌개',
        '김치찌개', '꽁치김치찌개', '도루묵찌개', '동태찌개', '돼지고기김치찌개', '된장찌개', '부대찌개', '생태찌개', '순두부찌개', '시래기된장지짐',
        '애호박찌개', '양푼김치찌개', '전복뚝배기', '차돌된장찌개', '참치김치찌개', '청국장찌개', '콩비지찌개', '해물뚝배기', '해물된장찌개', '해물순두부찌개',
        '갈비찜', '계란찜', '굴보쌈', '꼬리찜', '낙지찜', '누룽지닭백숙', '닭백숙', '대게찜', '대구뽈찜', '더덕보쌈', '도가니수육', '도미찜', '동태찜',
        '돼지등뼈찜', '등갈비묵은지찜', '뚝배기계란찜', '매운갈비찜', '머릿고기', '명태찜', '묵은지찜', '민어찜', '병어찜', '보쌈', '북어찜', '소갈비찜',
        '소꼬리찜', '소머리수육', '수육', '순대', '아귀찜', '아바이순대', '안동찜닭', '오리백숙', '오이선', '오징어순대', '전복갈비찜', '조기찜',
        '족발', '찜닭', '참꼬막찜', '코다리찜', '한방오리백숙', '한방오리찜', '해물찜', '홍어삼합', '홍어찜', '황기닭백숙', '황기족발', '황태찜',
        '훈제오리보쌈', '가지볶음', '감자볶음', '고구마맛탕', '곰장어볶음', '곱창볶음', '국물떡볶이', '궁중떡볶이', '김치볶음', '깻잎나물볶음',
        '꽈리고추멸치볶음', '낙지볶음', '낙지철판볶음', '느타리버섯볶음', '닭갈비', '닭강정', '닭똥집볶음', '닭볶음탕', '도치두루치기', '돼지고기두루치기',
        '돼지고기볶음', '돼지껍데기볶음', '두부김치', '떡볶이', '라볶이', '마른새우볶음', '매운닭발볶음', '머위나물볶음', '물오징어불고기', '미역줄기볶음',
        '순대볶음', '애호박볶음', '양념치킨', '어묵볶음', '오리주물럭', '오삼불고기', '오징어볶음', '오징어채볶음', '잔멸치볶음', '제육볶음', '주꾸미볶음',
        '죽순볶음', '쥐치채볶음', '즉석떡볶이', '철판순대볶음', '표고버섯볶음', '해물떡볶이', '가자미조림', '갈치조림', '감자조림', '고등어조림', '도미조림',
        '돼지고기', '메추리알장조림', '두부조림', '땅콩조림', '메추리알장조림', '묵은지고등어조림', '병어조림', '북어조림', '생멸치조림', '소고기',
        '메추리알장조림', '연근조림', '우럭조림', '우엉조림', '은대구조림', '장조림', '조기조림', '코다리조림', '콩조림', '가지나물', '간편잡채',
        '고구마순나물', '고사리나물', '고춧잎나물', '곤드레나물', '구절판', '깻잎순무침', '나물', '냉이나물', '대하냉채', '도라지나물', '무나물',
        '미나리나물', '미역초무침', '비름나물', '숙주나물', '시금치나물', '시래기나물', '쑥갓나물무침', '잡채', '죽순채', '참나물', '취나물', '콩나물무침',
        '탕평채', '골뱅이무침', '굴무침', '김무침', '꼬막무침', '노각무침', '달래무침', '대구포무침', '더덕생채', '도라지생채', '도토리묵', '도토리묵무침',
        '돌미나리무침', '두릅초회', '마늘종무침', '메밀무침', '메밀묵무침', '무말랭이무침', '무생채', '부추무침', '북어채무침', '상추겉절이',
        '영양부추겉절이', '오이무침', '오이미역초무침', '오이지무침', '오징어무침', '오징어초무침', '올챙이묵', '청포묵무침', '파래무침', '파무침',
        '해파리냉채', '갈낙전골', '곱창전골', '국수전골', '김치전골', '낙지전골', '닭한마리', '두부전골', '만두전골', '버섯전골', '불낙전골',
        '소고기국수전골', '소고기버섯전골', '소고기전골', '신선로', '해물낙지전골', '송이산적', '화양적', '가자미구이', '갈치구이', '고등어구이',
        '고추장불고기', '고추장삼겹살', '곰장어구이', '곱창구이', '광양불고기', '굴비구이', '김', '꼬치구이', '꽁치구이', '낙지호롱', '너비아니',
        '닭꼬치구이', '대창구이', '대패삼겹살', '대하구이', '대합구이', '더덕구이', '도루묵구이', '도리뱅뱅', '도미구이', '돼지갈비구이', '돼지막창구이',
        '등갈비구이', '등심구이', '떡갈비', '막창구이', '매운족발', '모던불고기', '바싹불고기', '병어구이', '보리굴비', '복불고기', '북어구이', '불고기',
        '삼겹살', '삼치구이', '새우구이', '생선구이', '석쇠돼지불고기', '소갈비구이', '소고기구이', '소고기편채', '소곱창구이', '솥뚜껑삼겹살', '숯불닭갈비',
        '양곱창구이', '양념갈비', '양념장어구이', '언양불고기', '오리구이', '오리로스', '오리불고기', '오징어구이', '오징어불고기', '옥돔구이', '은어구이',
        '임연수구이', '장어구이', '장작구이통닭', '전복구이', '전어구이', '조개구이', '차돌박이구이', '코다리구이', '황태구이', '훈제오리', 'LA갈비',
        '간장', '고추장', '된장', '막장', '볶음고추장', '쌈장', '초간장', '초고추장', '가죽장아찌', '간장게장', '고추장아찌', '김장아찌', '깻잎지',
        '노각장아찌', '더덕장아찌', '두릅장아찌', '마늘장아찌', '마늘종장아찌', '매실장아찌', '명이나물장아찌', '무말랭이장아찌', '무장아찌', '새우장',
        '양념게장', '양파장아찌', '오이지', '장아찌', '죽순장아찌', '콩잎장아찌', '가자미전', '감자전', '계란말이', '고구마튀김', '고추부각', '고추전',
        '굴전', '김말이튀김', '김부각', '김치전', '깻잎전', '꼬막전', '녹두전', '다시마부각', '단군신화전', '단호박튀김', '동그랑땡', '동태전',
        '두부전', '메밀전병', '모둠전', '미꾸라지튀김', '미나리전', '배추전', '버섯전', '복튀김', '부각', '부추전', '빈대떡', '새우튀김', '생선전',
        '수수부꾸미', '애호박전', '야채튀김', '연근전', '오징어튀김', '육전', '파래전', '파전', '해물부추전', '해물파전', '호박전', '갈치젓', '꼴뚜기젓',
        '낙지젓', '멸치젓', '명란젓', '명태식해', '새우젓', '어리굴젓', '오징어젓', '젓갈', '조개젓', '황석어젓', '강어회', '과메기', '광어회',
        '두부삼합', '모둠회', '문어삼합', '문어숙회', '물회', '민어회', '산낙지', '생선회', '송어회', '오징어물회', '육회', '자리물회', '전어무침',
        '전어회', '한치물회', '한치회무침', '홍어회무침', '회무침', '갓김치', '겉절이', '고들빼기김치', '깍두기', '깻잎김치', '나박김치', '돌나물물김치',
        '돌미나리물김치', '동치미', '배추겉절이', '배추김치', '백김치', '보쌈김치', '봄동겉절이', '부추김치', '섞박지', '열무김치', '열무얼갈이김치',
        '오이소박이', '총각김치', '파김치', '포기김치', '갈비만두', '고기만두', '군만두', '김치만두', '떡만둣국', '만두', '만둣국', '물만두', '송어만두',
        '왕만두', '채만두', '가래떡', '감자떡', '경단', '깨경단', '꿀떡', '녹두시루떡', '무지개떡', '백설기', '송편', '수수팥떡', '시루떡', '쑥떡',
        '약식', '인절미', '절편', '증편', '찹쌀떡', '호떡', '화전', '감말랭이', '강정', '곶감', '다식', '도라지정과', '매작과', '산자', '송화다식',
        '수삼정과', '약과', '흑임자다식', '기자차', '녹차', '단호박식혜', '대추차', '막걸리', '매실차', '모과차', '미숫가루', '생강차', '수정과',
        '식혜', '쌍화차', '오미자화채', '유자차', '유자화채', '인삼차', '팥빙수'
    ]

    start_time = time.time()
    # for keyword in keywords:
    #     print(keyword)
    #     search_keyword(keyword)

    pool = Pool(processes=8)  # CPU Core 개수
    pool.map(search_keyword, keywords)
    print("--- %s seconds ---" % (time.time() - start_time))
